<template>
  <main
    class="flex flex-col items-center cursor-default w-screen h-screen overflow-y-scroll"
  >
    <div
      class="w-2/3 p-4 m-4 bg-ppurple-200 bg-opacity-70 rounded-lg animate__animated animate__fadeInLeftBig animate__delay-1s"
    >
      <h1 class="font-bold text-lg text-center my-3">
        Древнее зло пробудилось
      </h1>
      В начале было ничто, спустя время появляется Божество и разлила путь,
      названный впоследствии белый горизонт. Через некоторое время в нем стали
      образовываться планеты и звезды. Одной из планет мужское божество ало
      жизнь в виде людей. Люди развивались и приносили богам жертвы.
      Человечество прошло путь от древних людей до современного общества. Многие
      философы начали говорить о том, что человечество совершенный вид и пора
      избавиться от гнета богов. Была организована военная операция в космос,
      главной целью которого стало свержения богов. Были кровавые бои и в
      конечном итоге было убито мужское божество. Женское божество не смогла
      вытерпеть смерть своего супруга и объявило человечество тотальное
      уничтожение. Для противостоянии были созданы первые прототипы ПРОБКИ,
      управляемые нео-пилотами удаленно. Женское божество удалось закинуть в
      черную дыру, на этом моменте люди думали, что навсегда избавились от нее и
      можно жить спокойно. Спокойно жилось только 100 лет, за это время
      человечество усовершенствовало корабль ПРОБКА и отправились покорять
      другие звезды и строить на них пункты отдыха для путешественников. Спустя
      100 лет Женскому божеству удалось выбраться из черной дыры и теперь готова
      перейти к тотальному уничтожению человечества Главный герой - нео-пилот
      ПРОБКа, которому уготовано сразиться с Женским божеством и остановить
      аннигиляцию человечества.
    </div>
    <div
      class="w-2/3 p-4 m-4 bg-ppurple-200 bg-opacity-70 rounded-lg animate__animated animate__fadeInLeft animate__delay-2s"
    >
      <h1 class="font-bold text-lg text-center my-3">Аркадный режим</h1>
      <ul class="text-center">
        <li>Древо Прокачки</li>
        <li>Таблица лидеров</li>
        <li>Бесконечные волны врагов</li>
        <li>Постепенное увеличение уровня сложности</li>
        <li>Начинаем с простых врагов, постепенно добавляем более сложных</li>
        <li>Таблица лидеров</li>
        <li>Появление мини боссов каждые N уровней</li>
        <li>Комбо уничтожения противников без получения урона</li>
        <li>После смерти все сбрасывается</li>
      </ul>
    </div>
    <div
      class="w-2/3 p-4 m-4 bg-ppurple-200 bg-opacity-70 rounded-lg animate__animated animate__fadeInLeft animate__delay-3s"
    >
      <h1 class="font-bold text-lg text-center my-3">О нас</h1>
      Мы, AVOCAT-team - независимая команда разработчиков. Сейчас мы работаем
      над кроссплатформенным проектом и нам как никогда нужна поддержка. Вы
      можете поддержать нас,
      <a href="https://vk.com/plush1love" class="text-ppurple-100"
        >подписавшись на группу</a
      >
      и/или
      <a
        href="https://vk.com/plush1love?source=description&w=donut_payment-207679913"
        class="text-ppurple-100"
        >оформить подписку на VK Donut</a
      >, где публикуются актуальные новости по разработке, а также кое-какие
      эксклюзивы.
    </div>
    <div class="py-28 w-full text-center">
      AVOCAT© team, 2022. All rights reserved
    </div>
  </main>
</template>

<style lang="scss">
main {
  &::-webkit-scrollbar {
    width: 7px;
  }
  &::-webkit-scrollbar-track {
    background-color: rgba(0, 0, 0, 0);
  }
  &::-webkit-scrollbar-thumb {
    background: #4e4e4e;
    border-radius: 25px;
  }
}
</style>
